; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image2 - mode
	spectrograph0 - mode
	thermograph3 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	Star6 - direction
	Star3 - direction
	Star0 - direction
	Star5 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument3 image2)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(have_image Star9 image2)
	(have_image Planet10 infrared1)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 thermograph3)
	(have_image Phenomenon13 thermograph3)
	(have_image Phenomenon14 image2)
	(have_image Star15 spectrograph0)
	(have_image Star16 spectrograph0)
))

)

; plan
1. (turn_to satellite1 star5 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star5)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon12 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon12)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon12 instrument3 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon11 instrument3 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 2 of 8
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 8
9. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 2 of 8
10. (turn_to satellite0 phenomenon14 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 8
11. (take_image satellite0 phenomenon14 instrument1 image2)
   added: (have_image phenomenon14 image2)
   goals met: 3 of 8
12. (turn_to satellite0 planet10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet10)
   goals met: 3 of 8
13. (take_image satellite0 planet10 instrument1 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 4 of 8
14. (turn_to satellite0 star15 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star15)
   goals met: 4 of 8
15. (take_image satellite0 star15 instrument1 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 5 of 8
16. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 5 of 8
17. (take_image satellite0 star16 instrument1 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 6 of 8
18. (turn_to satellite0 star9 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star9)
   goals met: 6 of 8
19. (take_image satellite0 star9 instrument1 image2)
   added: (have_image star9 image2)
   goals met: 7 of 8
20. (turn_to satellite1 phenomenon13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon13)
   goals met: 7 of 8
21. (take_image satellite1 phenomenon13 instrument3 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 8 of 8
